wangeshen/MICO/Platform/Common/Cortex-M3/STM32F2xx/stm32f2xx_platform_mxchip.c
    /* Init and enable SPI */
    SPI_Init( spi_mapping[spi->port].spi_regs, &spi_init );
    SPI_Cmd ( spi_mapping[spi->port].spi_regs, ENABLE );

    MCU_CLOCKS_NOT_NEEDED();

    current_spi_device = (wiced_spi_device_t*)spi;

    return WICED_SUCCESS;
}

wiced_result_t wiced_spi_transfer( const wiced_spi_device_t* spi, wiced_spi_message_segment_t* segments, uint16_t number_of_segments )
{
    wiced_result_t result = WICED_SUCCESS;
    uint16_t       i;
    uint32_t       count = 0;

    wiced_assert("Bad args", (spi != NULL) && (segments != NULL) && (number_of_segments != 0));

    MCU_CLOCKS_NEEDED();

    /* If the given SPI device is not the current SPI device, initialise */
    if ( spi != current_spi_device )
    {
        wiced_spi_init( spi );
    }

    /* Activate chip select */
    MicoGpioOutputLow(spi->chip_select);

    for ( i = 0; i < number_of_segments; i++ )
    {
        /* Check if we are using DMA */
        if ( spi->mode & SPI_USE_DMA )
        {
            spi_dma_config( spi, &segments[i] );
            result = spi_dma_transfer( spi );
            if ( result != WICED_SUCCESS )
            {
                goto cleanup_transfer;
            }
        }
        else
        {
            /* in interrupt-less mode */
            if ( spi->bits == 8 )
            {
                const uint8_t* send_ptr = ( const uint8_t* )segments[i].tx_buffer;
                uint8_t*       rcv_ptr  = ( uint8_t* )segments[i].rx_buffer;
                count = segments[i].length;
                while ( count-- )
                {
                    uint16_t data;
                    if ( send_ptr != NULL )
                    {
                        data = *send_ptr;
                        send_ptr++;
                    }
                    else
                    {
                        data = 0xFF;
                    }

                    /* Wait until the transmit buffer is empty */
                    while ( SPI_I2S_GetFlagStatus( spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_TXE ) == RESET )
                    {}

                    /* Send the byte */
                    SPI_I2S_SendData( spi_mapping[spi->port].spi_regs, data );

                    /* Wait until a data is received */
                    while ( SPI_I2S_GetFlagStatus( spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_RXNE ) == RESET )
                    {}

                    /* Get the received data */
                    data = SPI_I2S_ReceiveData( spi_mapping[spi->port].spi_regs );

                    if ( rcv_ptr != NULL )
                    {
                        *rcv_ptr++ = (uint8_t)data;
                    }
                }
            }
            else if ( spi->bits == 16 )
            {
                const uint16_t* send_ptr = (const uint16_t *) segments[i].tx_buffer;
                uint16_t*       rcv_ptr  = (uint16_t *) segments[i].rx_buffer;

                /* Check that the message length is a multiple of 2 */
                if ( ( count % 2 ) == 0 )
                {
                    result = WICED_ERROR;
                    goto cleanup_transfer;
                }

                while ( count != 0)
                {
                    uint16_t data = 0xFFFF;
                    count -= 2;

                    if ( send_ptr != NULL )
                    {
                        data = *send_ptr++;
                    }

                    /* Wait until the transmit buffer is empty */
                    while ( SPI_I2S_GetFlagStatus( spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_TXE ) == RESET )
                    {}

                    /* Send the byte */
                    SPI_I2S_SendData( spi_mapping[spi->port].spi_regs, data );

                    /* Wait until a data is received */
                    while ( SPI_I2S_GetFlagStatus( spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_RXNE ) == RESET )
                    {}

                    /* Get the received data */
                    data = SPI_I2S_ReceiveData( spi_mapping[spi->port].spi_regs );

                    if ( rcv_ptr != NULL )
                    {
                        *rcv_ptr++ = data;
                    }
                }
            }
        }
    }
cleanup_transfer:
    MicoGpioOutputHigh(spi->chip_select);

    MCU_CLOCKS_NOT_NEEDED();

    return result;
}

wiced_result_t wiced_spi_deinit( const wiced_spi_device_t* spi )
{
    GPIO_InitTypeDef gpio_init_structure;

    MCU_CLOCKS_NEEDED();

    /* De-init and disable SPI */
    SPI_Cmd( spi_mapping[ spi->port ].spi_regs, DISABLE );
    SPI_I2S_DeInit( spi_mapping[ spi->port ].spi_regs );

    /* Disable SPI peripheral clock */
    spi_mapping[spi->port].peripheral_clock_func( spi_mapping[spi->port].peripheral_clock_reg,  DISABLE );

    /* Reset all pins to input floating state */
    gpio_init_structure.GPIO_Mode  = GPIO_Mode_IN;      // Input
    gpio_init_structure.GPIO_PuPd  = GPIO_PuPd_NOPULL;  // Floating (No-pull)
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;     // Arbitrary. Only applicable for output
    gpio_init_structure.GPIO_Speed = GPIO_Speed_100MHz;
    gpio_init_structure.GPIO_Pin   = ((uint32_t) (1 << spi_mapping[spi->port].pin_clock->number)) |
                                     ((uint32_t) (1 << spi_mapping[spi->port].pin_miso->number )) |
                                     ((uint32_t) (1 << spi_mapping[spi->port].pin_mosi->number ));

    GPIO_Init( spi_mapping[spi->port].pin_clock->bank, &gpio_init_structure );

    /* Reset CS pin to input floating state */
    MicoGpioInitialize( spi->chip_select, INPUT_HIGH_IMPEDANCE );

    if ( spi == current_spi_device )
    {
        current_spi_device = NULL;
    }

    MCU_CLOCKS_NOT_NEEDED();

    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_init( wiced_i2c_device_t* device  )
{
    GPIO_InitTypeDef GPIO_InitStructure;
    I2C_InitTypeDef  I2C_InitStructure;

    wiced_assert( "bad argument", device != NULL );

    MCU_CLOCKS_NEEDED();

    // Init I2C GPIO clocks
    RCC_APB1PeriphClockCmd( i2c_mapping[device->port].peripheral_clock_reg, ENABLE );
    RCC_AHB1PeriphClockCmd( i2c_mapping[device->port].pin_scl->peripheral_clock | i2c_mapping[device->port].pin_sda->peripheral_clock, ENABLE );
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_SYSCFG, ENABLE );

