wangeshen/MICO/Platform/Common/Cortex-M3/STM32F2xx/stm32f2xx_platform_mxchip.c
    // Reset the I2C clock
    RCC_APB1PeriphResetCmd( i2c_mapping[device->port].peripheral_clock_reg, ENABLE );
    RCC_APB1PeriphResetCmd( i2c_mapping[device->port].peripheral_clock_reg, DISABLE );

    // GPIO Configuration
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
    GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;

    GPIO_InitStructure.GPIO_Pin = (uint32_t)( 1 << i2c_mapping[device->port].pin_scl->number );
    GPIO_Init( i2c_mapping[device->port].pin_scl->bank, &GPIO_InitStructure );
    GPIO_InitStructure.GPIO_Pin = (uint32_t)( 1 << i2c_mapping[device->port].pin_sda->number );
    GPIO_Init( i2c_mapping[device->port].pin_sda->bank, &GPIO_InitStructure );

    // Configure SDA and SCL as I2C pins
    GPIO_PinAFConfig( i2c_mapping[device->port].pin_scl->bank, (uint16_t)i2c_mapping[device->port].pin_scl->number, (uint8_t)i2c_mapping[device->port].gpio_af );
    GPIO_PinAFConfig( i2c_mapping[device->port].pin_sda->bank, (uint16_t)i2c_mapping[device->port].pin_sda->number, (uint8_t)i2c_mapping[device->port].gpio_af );

    if ( device->flags & I2C_DEVICE_USE_DMA )
    {
        // Enable the DMA clock
        RCC_AHB1PeriphClockCmd( i2c_mapping[device->port].tx_dma_peripheral_clock, ENABLE );

        // Configure the DMA streams for operation with the CP
        i2c_dma_init.DMA_Channel            = i2c_mapping[device->port].tx_dma_channel;
        i2c_dma_init.DMA_PeripheralBaseAddr = (uint32_t)&i2c_mapping[device->port].i2c->DR;
        i2c_dma_init.DMA_PeripheralInc      = DMA_PeripheralInc_Disable;
        i2c_dma_init.DMA_MemoryInc          = DMA_MemoryInc_Enable;
        i2c_dma_init.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
        i2c_dma_init.DMA_MemoryDataSize     = DMA_MemoryDataSize_Byte;
        i2c_dma_init.DMA_Mode               = DMA_Mode_Normal;
        i2c_dma_init.DMA_Priority           = DMA_Priority_VeryHigh;
        //dma_init.DMA_FIFOMode           = DMA_FIFOMode_Enable;
        //dma_init.DMA_FIFOThreshold      = DMA_FIFOThreshold_Full;
        i2c_dma_init.DMA_MemoryBurst        = DMA_MemoryBurst_Single;
        i2c_dma_init.DMA_PeripheralBurst    = DMA_PeripheralBurst_Single;
        i2c_dma_init.DMA_Memory0BaseAddr    = (uint32_t) 0;               // This parameter will be configured during communication
        i2c_dma_init.DMA_DIR                = DMA_DIR_MemoryToPeripheral; // This parameter will be configured during communication
        i2c_dma_init.DMA_BufferSize         = 0xFFFF;                     // This parameter will be configured during communication

        DMA_DeInit( i2c_mapping[device->port].rx_dma_stream );
        DMA_DeInit( i2c_mapping[device->port].tx_dma_stream );

        // Clear any pending flags, disable, and clear the Tx DMA channel
        //DMA_ClearFlag( i2c_mapping[device->port].tx_dma_stream, CP_TX_DMA_FLAG_FEIF | CP_TX_DMA_FLAG_DMEIF | CP_TX_DMA_FLAG_TEIF | CP_TX_DMA_FLAG_HTIF | CP_TX_DMA_FLAG_TCIF );
        DMA_Cmd( i2c_mapping[device->port].tx_dma_stream, DISABLE );
        DMA_Cmd( i2c_mapping[device->port].rx_dma_stream, DISABLE );

        // Clear any pending flags, disable, and clear the Rx DMA channel
        //DMA_ClearFlag( i2c_mapping[device->port].rx_dma_stream, CP_RX_DMA_FLAG_FEIF | CP_RX_DMA_FLAG_DMEIF | CP_RX_DMA_FLAG_TEIF | CP_RX_DMA_FLAG_HTIF | CP_RX_DMA_FLAG_TCIF );
    }

    // Initialize the InitStruct for the CP
    I2C_InitStructure.I2C_Mode                = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle           = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1         = 0xA0;
    I2C_InitStructure.I2C_Ack                 = I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;

    if ( device->speed_mode == I2C_LOW_SPEED_MODE )
    {
        I2C_InitStructure.I2C_ClockSpeed = 10000;
    }
    else if ( device->speed_mode == I2C_STANDARD_SPEED_MODE )
    {
        I2C_InitStructure.I2C_ClockSpeed = 100000;
    }
    else if ( device->speed_mode == I2C_HIGH_SPEED_MODE )
    {
        I2C_InitStructure.I2C_ClockSpeed = 400000;
    }

    // Enable and initialize the I2C bus
    I2C_Cmd ( i2c_mapping[device->port].i2c, ENABLE );
    I2C_Init( i2c_mapping[device->port].i2c, &I2C_InitStructure );

    if ( device->flags & I2C_DEVICE_USE_DMA )
    {
        // Enable DMA on the I2C bus
        I2C_DMACmd( i2c_mapping[device->port].i2c, ENABLE );
    }

    MCU_CLOCKS_NOT_NEEDED();

    return WICED_SUCCESS;
}

static wiced_result_t i2c_wait_for_event( I2C_TypeDef* i2c, uint32_t event_id, uint32_t number_of_waits )
{
    wiced_assert( "bad argument", i2c != NULL );

    while ( I2C_CheckEvent( i2c, event_id ) != SUCCESS )
    {
        number_of_waits--;
        if ( number_of_waits == 0 )
        {
            return WICED_TIMEOUT;
        }
    }

    return WICED_SUCCESS;
}

static uint32_t dma_flag_tc( int stream_id )
{
    const uint32_t transfer_complete_flags[]=
    {
        /* for every stream get a transfer complete flag */
        [0] =  DMA_FLAG_TCIF0,
        [1] =  DMA_FLAG_TCIF1,
        [2] =  DMA_FLAG_TCIF2,
        [3] =  DMA_FLAG_TCIF3,
        [4] =  DMA_FLAG_TCIF4,
        [5] =  DMA_FLAG_TCIF5,
        [6] =  DMA_FLAG_TCIF6,
        [7] =  DMA_FLAG_TCIF7,
    };

    return transfer_complete_flags[stream_id];
}

wiced_bool_t wiced_i2c_probe_device( wiced_i2c_device_t* device, int retries )
{
    int            i;
    wiced_result_t result;

    wiced_assert("Bad args", device != NULL);

    MCU_CLOCKS_NEEDED();

    for ( i = 0; i < retries; i++ )
    {
        /* generate a start condition and address a device in write mode */
        I2C_GenerateSTART( i2c_mapping[device->port].i2c, ENABLE );

        /* wait till start condition is generated and the bus becomes free */
        result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_MODE_SELECT, I2C_FLAG_CHECK_TIMEOUT );
        if ( result != WICED_SUCCESS )
        {
            MCU_CLOCKS_NOT_NEEDED();
            return WICED_FALSE;
        }

