wangeshen/MICO/Platform/Common/Cortex-M3/STM32F2xx/stm32f2xx_platform_mxchip.c
        if ( device->address_width == I2C_ADDRESS_WIDTH_7BIT )
        {
            /* send the address and R/W bit set to write of the requested device, wait for an acknowledge */
            I2C_Send7bitAddress( i2c_mapping[device->port].i2c, (uint8_t) ( device->address << 1 ), I2C_Direction_Transmitter );

            /* wait till address gets sent and the direction bit is sent and */
            result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
            if ( result != WICED_SUCCESS )
            {
                /* keep on pinging */
                continue;
            }
            else
            {
                break;
            }
        }
        else
        {
            // TODO
            /* send 10 bits of the address and wait for an acknowledge */
        }
    }

    /* generate a stop condition */
    I2C_GenerateSTOP( i2c_mapping[device->port].i2c, ENABLE );

    /* Check if the device didn't respond */
    if ( i == retries )
    {
        MCU_CLOCKS_NOT_NEEDED();
        return WICED_FALSE;
    }
    else
    {
        MCU_CLOCKS_NEEDED();
        return WICED_TRUE;
    }
}

static wiced_result_t i2c_dma_config_and_execute( wiced_i2c_device_t* device, wiced_i2c_message_t* message, wiced_bool_t tx_dma  )
{
    uint32_t counter;

    wiced_assert( "bad argument", device != NULL );
    wiced_assert( "bad argument", message != NULL );

    /* Initialize the DMA with the new parameters */
    if ( tx_dma == WICED_TRUE )
    {
        /* Enable DMA channel for I2C */
        I2C_DMACmd( i2c_mapping[device->port].i2c, ENABLE );

        /* TX DMA configuration */
        DMA_DeInit( i2c_mapping[device->port].tx_dma_stream );

        /* Configure the DMA TX Stream with the buffer address and the buffer size */
        i2c_dma_init.DMA_Memory0BaseAddr = (uint32_t)message->tx_buffer;
        i2c_dma_init.DMA_DIR             = DMA_DIR_MemoryToPeripheral;
        i2c_dma_init.DMA_BufferSize      = (uint32_t)message->tx_length;
        DMA_Init(i2c_mapping[device->port].tx_dma_stream, &i2c_dma_init);

        /* Enable DMA channel */
        DMA_Cmd( i2c_mapping[device->port].tx_dma_stream, ENABLE );

        /* wait until transfer is completed */
        /* TODO: change flag!!!!,wait on a semaphore */
        counter = DMA_TIMEOUT_LOOPS;
        while ( DMA_GetFlagStatus( i2c_mapping[device->port].tx_dma_stream, DMA_FLAG_TC(i2c_mapping[device->port].tx_dma_stream_id) ) == RESET )
        {
            --counter;
            if ( counter == 0 )
            {
                return WICED_ERROR;
            }
        }

        /* Disable DMA and channel */
        I2C_DMACmd( i2c_mapping[device->port].i2c, DISABLE );
        DMA_Cmd( i2c_mapping[device->port].tx_dma_stream, DISABLE );
    }
    else
    {
        /* Enable dma channel for I2C */
        I2C_DMACmd( i2c_mapping[device->port].i2c, ENABLE );

        /* RX DMA configuration */
        DMA_DeInit( i2c_mapping[device->port].rx_dma_stream );

        /* Configure the DMA Rx Stream with the buffer address and the buffer size */
        i2c_dma_init.DMA_Memory0BaseAddr = (uint32_t)message->rx_buffer;
        i2c_dma_init.DMA_DIR             = DMA_DIR_PeripheralToMemory;
        i2c_dma_init.DMA_BufferSize      = (uint32_t)message->rx_length;
        DMA_Init(i2c_mapping[device->port].rx_dma_stream, &i2c_dma_init);

        /* Enable DMA channel */
        DMA_Cmd( i2c_mapping[device->port].rx_dma_stream, ENABLE );

        /* wait until transfer is completed */
        counter = DMA_TIMEOUT_LOOPS;
        while ( DMA_GetFlagStatus( i2c_mapping[device->port].rx_dma_stream, DMA_FLAG_TC(i2c_mapping[device->port].rx_dma_stream_id) ) == RESET )
        {
            --counter;
            if ( counter == 0 )
            {
                return WICED_ERROR;
            }
        }

        /* disable DMA and channel */
        I2C_DMACmd( i2c_mapping[device->port].i2c, DISABLE );
        DMA_Cmd( i2c_mapping[device->port].rx_dma_stream, DISABLE );
    }

    return WICED_SUCCESS;
}

static wiced_result_t i2c_dma_transfer( wiced_i2c_device_t* device, wiced_i2c_message_t* message )
{
    wiced_result_t result;
    uint32_t       counter;
    int            i = 0;

    if ( message->combined == WICED_TRUE )
    {
        /* combined transaction case, please refer to Philips I2C document to have an understanding of a combined fragment */

        /* some chips( authentication and security related chips ) has to be addressed several times before they acknowledge their address */
        for ( i = 0; i < message->retries; i++ )
        {
            /* generate a start condition and address a device in write mode */
            I2C_GenerateSTART( i2c_mapping[device->port].i2c, ENABLE );

            /* wait till start condition is generated and the bus becomes free */
            result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_MODE_SELECT, I2C_FLAG_CHECK_TIMEOUT );
            if ( result != WICED_SUCCESS )
            {
                return WICED_TIMEOUT;
            }

            if ( device->address_width == I2C_ADDRESS_WIDTH_7BIT )
            {
                /* send the address and R/W bit set to write of the requested device, wait for an acknowledge */
                I2C_Send7bitAddress( i2c_mapping[device->port].i2c, (uint8_t) ( device->address << 1 ), I2C_Direction_Transmitter );

                /* wait till address gets sent and the direction bit is sent and */
                result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
                if ( result == WICED_SUCCESS )
                {
                    break;
                }
            }
            else
            {
                //TODO
                /* send 10 bits of the address and wait for an acknowledge */
            }
        }

