wangeshen/MICO/Platform/Common/Cortex-M3/STM32F2xx/stm32f2xx_platform_mxchip.c
        /* read or write transaction */

        /* some chips( authentication and security related chips ) has to be addressed several times before they acknowledge their address */
        for ( i = 0; i < message->retries; i++ )
        {
            /* generate a start condition */
            I2C_GenerateSTART( i2c_mapping[device->port].i2c, ENABLE );

            /* wait till start condition is generated and the bus becomes free */
            result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_MODE_SELECT, I2C_FLAG_CHECK_TIMEOUT );
            if ( result != WICED_SUCCESS )
            {
                return WICED_TIMEOUT;
            }
            if ( device->address_width == I2C_ADDRESS_WIDTH_7BIT )
            {
                /* send the address of the requested device, wait for an acknowledge */
                I2C_Send7bitAddress( i2c_mapping[device->port].i2c, (uint8_t) ( device->address << 1 ), ( ( message->tx_buffer ) ? I2C_Direction_Transmitter : I2C_Direction_Receiver ) );

                /* wait till address gets sent and the direction bit is sent */
                if ( message->tx_buffer )
                {
                    result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
                }
                else
                {
                    result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED, I2C_FLAG_CHECK_LONG_TIMEOUT );
                }
                if ( result != WICED_SUCCESS )
                {
                    continue;
                }
                else
                {
                    break;
                }
            }
            else
            {
                //TODO
                /* send 10 bits of the address and wait for an acknowledge */
            }
        }
        if ( i == message->retries )
        {
            return WICED_TIMEOUT;
        }

        if ( message->tx_buffer )
        {
            /* write transaction */

            const char* temp_ptr = (const char*) message->tx_buffer;
            /* send data to the i2c device */
            for ( i = 0; i < message->tx_length; i++ )
            {
                I2C_SendData( i2c_mapping[device->port].i2c, (uint8_t) temp_ptr[i] );

                /* wait till it actually gets transferred and acknowledged */
                result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_BYTE_TRANSMITTED, I2C_FLAG_CHECK_TIMEOUT );
                if ( result != WICED_SUCCESS )
                {
                    return result;
                }
            }
        }
        else
        {
            /* read transaction */

            uint8_t* tmp_ptr = (uint8_t*) message->rx_buffer;
            if ( message->rx_length == 1 )
            {
                /* disable acknowledgement before we are going to receive a single byte */
                I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, DISABLE );
            }
            else
            {
                /* enable acknowledgement before we start receiving multiple bytes */
                I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, ENABLE );
            }
            /* receive data from the i2c device */
            for ( i = 0; i < message->rx_length; i++ )
            {
                /* wait till something is in the i2c data register */
                result = i2c_wait_for_event( i2c_mapping[device->port].i2c, I2C_EVENT_MASTER_BYTE_RECEIVED, I2C_FLAG_CHECK_TIMEOUT );
                if ( result != WICED_SUCCESS )
                {
                    return result;
                }

                /* get data */
                tmp_ptr[i] = I2C_ReceiveData( i2c_mapping[device->port].i2c );
                if ( i == ( message->rx_length - 1 ) )
                {
                    /* setup NACK for the last byte to be received */
                    I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, DISABLE );
                }
                else
                {
                    /* setup an acknowledgement beforehand for every byte that is to be received */
                    I2C_AcknowledgeConfig( i2c_mapping[device->port].i2c, ENABLE );
                }
            }
        }
    }

    /* generate a stop condition */
    I2C_GenerateSTOP( i2c_mapping[device->port].i2c, ENABLE );
    return WICED_SUCCESS;

}

wiced_result_t wiced_i2c_init_tx_message(wiced_i2c_message_t* message, const void* tx_buffer, uint16_t  tx_buffer_length, uint16_t retries , wiced_bool_t disable_dma)
{
    if( ( message == 0 ) || ( tx_buffer == 0 ) || ( tx_buffer_length == 0 ) )
    {
        return WICED_BADARG;
    }
    memset(message, 0x00, sizeof(wiced_i2c_message_t));
    message->tx_buffer = tx_buffer;
    message->combined = WICED_FALSE;
    message->retries = retries;
    message->tx_length = tx_buffer_length;
    if( disable_dma )
    {
        message->flags = I2C_MESSAGE_NO_DMA;
    }
    else
    {
        message->flags = I2C_MESSAGE_USE_DMA;
    }
    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_init_rx_message(wiced_i2c_message_t* message, void* rx_buffer, uint16_t  rx_buffer_length, uint16_t retries , wiced_bool_t disable_dma)
{
    if( ( message == 0 ) || ( rx_buffer == 0 ) || ( rx_buffer_length == 0 ) )
    {
        return WICED_BADARG;
    }
    memset(message, 0x00, sizeof(wiced_i2c_message_t));
    message->rx_buffer = rx_buffer;
    message->combined = WICED_FALSE;
    message->retries = retries;
    message->rx_length = rx_buffer_length;
    if( disable_dma )
    {
        message->flags = I2C_MESSAGE_NO_DMA;
    }
    else
    {
        message->flags = I2C_MESSAGE_USE_DMA;
    }
    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_init_combined_message(wiced_i2c_message_t* message, const void* tx_buffer, void* rx_buffer, uint16_t tx_buffer_length, uint16_t rx_buffer_length, uint16_t retries , wiced_bool_t disable_dma)
{
    if( ( message == 0 ) || ( rx_buffer == 0 ) || ( tx_buffer == 0 ) || ( tx_buffer_length == 0 ) || ( rx_buffer_length == 0 ) )
    {
        return WICED_BADARG;
    }
    memset(message, 0x00, sizeof(wiced_i2c_message_t));
    message->rx_buffer = rx_buffer;
    message->tx_buffer = tx_buffer;
    message->combined = WICED_TRUE;
    message->retries = retries;
    message->tx_length = tx_buffer_length;
    message->rx_length = rx_buffer_length;
    if( disable_dma )
    {
        message->flags = I2C_MESSAGE_NO_DMA;
    }
    else
    {
        message->flags = I2C_MESSAGE_USE_DMA;
    }
    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_transfer( wiced_i2c_device_t* device, wiced_i2c_message_t* messages, uint16_t number_of_messages )
{
    wiced_result_t result;
    int i = 0;

    wiced_assert( "bad argument", (device != NULL) && (messages != NULL) );

    MCU_CLOCKS_NEEDED();

    for( i=0; i < number_of_messages; i++ )
    {
        if( ( device->flags & I2C_DEVICE_USE_DMA ) && ( ( messages[i].flags & I2C_MESSAGE_USE_DMA ) == 1 ) )
        {
            result = i2c_dma_transfer(device, &messages[i]);
            if( result != WICED_SUCCESS )
            {
                MCU_CLOCKS_NOT_NEEDED();
                return WICED_ERROR;
            }
        }
        else
        {
            result = i2c_transfer_message_no_dma( device, &messages[i] );
            if( result != WICED_SUCCESS )
            {
                MCU_CLOCKS_NOT_NEEDED();
                return WICED_ERROR;
            }
        }
    }

    MCU_CLOCKS_NOT_NEEDED();
    return WICED_SUCCESS;
}

wiced_result_t wiced_i2c_deinit( wiced_i2c_device_t* device )
{
    MCU_CLOCKS_NEEDED();

    /* Disable I2C peripheral clocks */
    RCC_APB1PeriphClockCmd( i2c_mapping[device->port].peripheral_clock_reg, DISABLE );

    /* Disable sda, scl gpio clocks */
    RCC_AHB1PeriphClockCmd( i2c_mapping[device->port].pin_scl->peripheral_clock | i2c_mapping[device->port].pin_sda->peripheral_clock, DISABLE );

