wangeshen/MICO/Platform/Common/Cortex-M3/STM32F2xx/stm32f2xx_platform_mxchip.c
    /* Mark new DCT as complete and current */
    platform_write_flash_chunk( (uint32_t)&new_dct->write_incomplete, (uint8_t*) &zero_byte, sizeof(zero_byte) );
    platform_write_flash_chunk( (uint32_t)&curr_dct->is_current_dct, (uint8_t*) &zero_byte, sizeof(zero_byte) );

    return 0;
}

int platform_erase_flash( uint16_t start_sector, uint16_t end_sector )
{
    uint32_t i;

    /* Unlock the STM32 Flash */
    FLASH_Unlock( );

    /* Clear any error flags */
    FLASH_ClearFlag( FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR );

    watchdog_kick( );

    for ( i = start_sector; i <= end_sector; i += 8 )
    {
        if ( FLASH_EraseSector( i, ERASE_VOLTAGE_RANGE ) != FLASH_COMPLETE )
        {
            /* Error occurred during erase. */
            /* TODO: Handle error */
            while ( 1 )
            {
            }
        }
        watchdog_kick( );
    }

    FLASH_Lock( );

    return 0;
}

int platform_write_app_chunk( uint32_t offset, const uint8_t* data, uint32_t size )
{
    return platform_write_flash_chunk( APP_HDR_START_ADDR + offset, data, size );
}

int platform_write_flash_chunk( uint32_t address, const uint8_t* data, uint32_t size )
{
    uint32_t write_address  = address;
    const uint8_t* end_of_data = data + size;
    const uint8_t* data_iter   = data;
//    flash_write_t* data_ptr = (flash_write_t*) data;
//    flash_write_t* end_ptr  = (flash_write_t*) &data[size];

    FLASH_Unlock( );

    /* Clear any error flags */
    FLASH_ClearFlag( FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR );

    /* Write data to STM32 flash memory */
    while ( data_iter <  end_of_data )
    {
        FLASH_Status status;

        if ( ( ( ((uint32_t)write_address) & 0x03 ) == 0 ) && ( end_of_data - data_iter >= FLASH_WRITE_SIZE ) )
        {
            int tries = 0;
            /* enough data available to write as the largest size allowed by supply voltage */
            while ( ( FLASH_COMPLETE != ( status = FLASH_WRITE_FUNC( write_address, *((flash_write_t*)data_iter) ) ) ) && ( tries < 10 ) )
            {
                tries++;
            }
            if ( FLASH_COMPLETE != status )
            {
                /* TODO: Handle error properly */
                wiced_assert("Error during write", 0 != 0 );
                return 1;
            }
            write_address += FLASH_WRITE_SIZE;
            data_iter     += FLASH_WRITE_SIZE;
        }
        else
        {
            int tries = 0;
            /* Limited data available - write in bytes */
            while ( ( FLASH_COMPLETE != ( status = FLASH_ProgramByte( write_address, *data_iter ) ) ) && ( tries < 10 ) )
            {
                tries++;
            }
            if ( FLASH_COMPLETE != status )
            {
                /* TODO: Handle error properly */
                wiced_assert("Error during write", 0 != 0 );
                return 1;
            }
            ++write_address;
            ++data_iter;
        }

    }

    FLASH_Lock();

    return 0;
}
#endif

/******************************************************
 *            Interrupt Service Routines
 ******************************************************/

#ifdef BUS_SPI
WEAK void sdio_irq(void)
{
}
#endif

#ifdef MXCHIP_APP
extern void uart_send_no_dma(const void*data, uint32_t size);

/* STDIO Read/Write functions for Newlib */
void platform_stdio_write( const char* str, uint32_t len )
{
#ifndef MICO_DISABLE_STDIO
    host_rtos_get_semaphore( &stdio_tx_mutex, WICED_NEVER_TIMEOUT, WICED_FALSE );
    uart_send_no_dma(str, len);
    while( ( uart_mapping[STDIO_UART].usart->SR & USART_SR_TC )== 0 );
    host_rtos_set_semaphore( &stdio_tx_mutex, WICED_FALSE );
#else
    UNUSED_PARAMETER( str );
    UNUSED_PARAMETER( len );
#endif
}
#else
/* STDIO Read/Write functions for Newlib */
void platform_stdio_write( const char* str, uint32_t len )
{
#ifndef MICO_DISABLE_STDIO
    MicoUartSend( STDIO_UART, (void*)str, len );
#else
    UNUSED_PARAMETER( str );
    UNUSED_PARAMETER( len );
#endif
}
#endif

void platform_stdio_read( char* str, uint32_t len )
{
#ifndef MICO_DISABLE_STDIO
    MicoUartRecv( STDIO_UART, (void*)str, len, MICO_NEVER_TIMEOUT );
#else
    UNUSED_PARAMETER( str );
    UNUSED_PARAMETER( len );
#endif
}

#define RTC_INTERRUPT_EXTI_LINE EXTI_Line22
#define WUT_COUNTER_MAX  0xffff

#define ENABLE_INTERRUPTS   __asm("CPSIE i")
#define DISABLE_INTERRUPTS  __asm("CPSID i")

#if defined(WICED_DISABLE_MCU_POWERSAVE) && defined(WICED_ENABLE_MCU_RTC)
/*  */
void platform_rtc_init(void)
{
    RTC_InitTypeDef RTC_InitStruct;

    RTC_DeInit( );

    RTC_InitStruct.RTC_HourFormat = RTC_HourFormat_24;

    /* RTC ticks every second */
    RTC_InitStruct.RTC_AsynchPrediv = 0x7F;
    RTC_InitStruct.RTC_SynchPrediv = 0xFF;

    RTC_Init( &RTC_InitStruct );
    /* Enable the LSE OSC */
    RCC_LSEConfig(RCC_LSE_ON);
    /* Wait till LSE is ready */
    while(RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET)
    {
    }
    /* Select the RTC Clock Source */
    RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);

    /* Enable the RTC Clock */
    RCC_RTCCLKCmd(ENABLE);

    /* RTC configuration -------------------------------------------------------*/
    /* Wait for RTC APB registers synchronisation */
    RTC_WaitForSynchro();

#ifdef USE_RTC_BKP
    if (RTC_ReadBackupRegister(RTC_BKP_DR0) != USE_RTC_BKP) {
        /* set it to 12:20:30 08/04/2013 monday */
        wiced_default_time.sec   = 0,
        wiced_default_time.min   = 0,
        wiced_default_time.hr    = 0,
        wiced_default_time.weekday  = 1,
        wiced_default_time.date  = 8,
        wiced_default_time.month = 4,
        wiced_default_time.year  = 13
        platform_set_rtc_time(&wiced_default_time);
        RTC_WriteBackupRegister(RTC_BKP_DR0, USE_RTC_BKP);
    }
#else
    /* write default application time inside rtc */
    platform_set_rtc_time(&wiced_default_time);
#endif

